<?php
#====================================================================================================
# $Id: outputfilter.kanaFilter.php,v 1.1.1.1 2006/09/21 14:10:39 matsui Exp $
# KEMP Smarty-Plugin Outputfilter カナフィルタ
# 2006/09/21 matsui@ke-tai.org
#====================================================================================================
# 機能：
# 全角から半角へ変換を行う
#====================================================================================================
# 修正履歴：
# 
# 
#====================================================================================================

/**
 * カナフィルタ
 * @param	string	$tpl_output		出力内容
 * @return	string					コンバート済みの出力内容
 */
function smarty_outputfilter_kanaFilter($tpl_output)
{
	// 全角　→　半角　変換
	mb_internal_encoding('SJIS');
	$tpl_output = mb_convert_kana($tpl_output, 'ak');
	
	// 出力内容を返す
	return $tpl_output;
}

?>